#language: ru
Функционал: Эльдорадо - интернет магазин

  @success
  Сценарий: Проверки покупки и последующей отмены заказа
    * загружена страница "StartPage"
    * нажать на "Регистрация"
    * загружена страница "RegistrationPage"
    * поле "Email" заполняется значением "32nf9@gmail.com"
    * поле "Имя" заполняется значением "Иван"
    * поле "Отчество" заполняется значением "Иванович"
    * поле "Фамилия" заполняется значением "Иванов"
    * поле "Дата Рождения" заполняется значением "11111993"
    * поле "Пароль" заполняется значением "QwertY123"
    * нажать на "Зарегистрироваться"
    * закрыто всплывающее окно
    * Переход на страницу "MyOrdersPage" выполнен, элемент "Мои заказы" доступен
    * выполнить поиск "Samsung Galaxy S10"
    * нажать на "Добавить в корзину"
    * нажать на "Корзина"
    * загружена страница "BasketPage"
    * нажать на "Доставка по Москве"
    * нажать на "Оформить заказ"
    * загружена страница "DeliveryPage"
    * поле "Код" заполняется значением "903"
    * поле "Номер" заполняется значением "9998899"
    * поле "Метро" заполняется значением "Бабушкинская"
    * поле "Улица" заполняется значением "Летная"
    * нажать на "Летная"
    * поле "Дом" заполняется значением "11"
    * поле "Строение" заполняется значением "11"
    * нажать на "Продолжить"
    * загружена страница "PaymentPage"
    * нажать на "Наличный расчет"
    * нажать на "Продолжить"
    * нажать на "Подтвердить заказ"
    * нажать на "Личный кабинет"
    * загружена страница "PrivateOfficePage"
    * нажать на "Мои заказы"
    * нажать на "Отменить заказ"
    * нажать на "Подтвердить отмену"


























    